###############################################################
#  Generated by:      Cadence Innovus 16.20-p002_1
#  OS:                Linux x86_64(Host ID joker.ece.northwestern.edu)
#  Generated on:      Sun Nov  9 01:16:39 2025
#  Design:            DNN
#  Command:           saveDesign DNN_powerroute_clk4_filler.enc
###############################################################
current_design DNN
create_clock [get_ports {s_axi_aclk}]  -name s_axi_aclk -period 10.000000 -waveform {0.000000 5.000000}
set_propagated_clock  [get_ports {s_axi_aclk}]
set_max_capacitance 0.01  [get_ports {s_axi_aclk}]
set_max_capacitance 0.01  [get_ports {s_axi_aresetn}]
set_max_capacitance 0.01  [get_ports {axis_in_data[15]}]
set_max_capacitance 0.01  [get_ports {axis_in_data[14]}]
set_max_capacitance 0.01  [get_ports {axis_in_data[13]}]
set_max_capacitance 0.01  [get_ports {axis_in_data[12]}]
set_max_capacitance 0.01  [get_ports {axis_in_data[11]}]
set_max_capacitance 0.01  [get_ports {axis_in_data[10]}]
set_max_capacitance 0.01  [get_ports {axis_in_data[9]}]
set_max_capacitance 0.01  [get_ports {axis_in_data[8]}]
set_max_capacitance 0.01  [get_ports {axis_in_data[7]}]
set_max_capacitance 0.01  [get_ports {axis_in_data[6]}]
set_max_capacitance 0.01  [get_ports {axis_in_data[5]}]
set_max_capacitance 0.01  [get_ports {axis_in_data[4]}]
set_max_capacitance 0.01  [get_ports {axis_in_data[3]}]
set_max_capacitance 0.01  [get_ports {axis_in_data[2]}]
set_max_capacitance 0.01  [get_ports {axis_in_data[1]}]
set_max_capacitance 0.01  [get_ports {axis_in_data[0]}]
set_max_capacitance 0.01  [get_ports {axis_in_data_valid}]
set_load -pin_load -max  0.05  [get_ports {axis_in_data_ready}]
set_load -pin_load -min  0.05  [get_ports {axis_in_data_ready}]
set_load -pin_load -max  0.05  [get_ports {class_id[3]}]
set_load -pin_load -min  0.05  [get_ports {class_id[3]}]
set_load -pin_load -max  0.05  [get_ports {class_id[2]}]
set_load -pin_load -min  0.05  [get_ports {class_id[2]}]
set_load -pin_load -max  0.05  [get_ports {class_id[1]}]
set_load -pin_load -min  0.05  [get_ports {class_id[1]}]
set_load -pin_load -max  0.05  [get_ports {class_id[0]}]
set_load -pin_load -min  0.05  [get_ports {class_id[0]}]
set_load -pin_load -max  0.05  [get_ports {class_valid}]
set_load -pin_load -min  0.05  [get_ports {class_valid}]
set_max_capacitance 0.01  [get_ports {weightValid}]
set_max_capacitance 0.01  [get_ports {biasValid}]
set_max_capacitance 0.01  [get_ports {weightValue[31]}]
set_max_capacitance 0.01  [get_ports {weightValue[30]}]
set_max_capacitance 0.01  [get_ports {weightValue[29]}]
set_max_capacitance 0.01  [get_ports {weightValue[28]}]
set_max_capacitance 0.01  [get_ports {weightValue[27]}]
set_max_capacitance 0.01  [get_ports {weightValue[26]}]
set_max_capacitance 0.01  [get_ports {weightValue[25]}]
set_max_capacitance 0.01  [get_ports {weightValue[24]}]
set_max_capacitance 0.01  [get_ports {weightValue[23]}]
set_max_capacitance 0.01  [get_ports {weightValue[22]}]
set_max_capacitance 0.01  [get_ports {weightValue[21]}]
set_max_capacitance 0.01  [get_ports {weightValue[20]}]
set_max_capacitance 0.01  [get_ports {weightValue[19]}]
set_max_capacitance 0.01  [get_ports {weightValue[18]}]
set_max_capacitance 0.01  [get_ports {weightValue[17]}]
set_max_capacitance 0.01  [get_ports {weightValue[16]}]
set_max_capacitance 0.01  [get_ports {weightValue[15]}]
set_max_capacitance 0.01  [get_ports {weightValue[14]}]
set_max_capacitance 0.01  [get_ports {weightValue[13]}]
set_max_capacitance 0.01  [get_ports {weightValue[12]}]
set_max_capacitance 0.01  [get_ports {weightValue[11]}]
set_max_capacitance 0.01  [get_ports {weightValue[10]}]
set_max_capacitance 0.01  [get_ports {weightValue[9]}]
set_max_capacitance 0.01  [get_ports {weightValue[8]}]
set_max_capacitance 0.01  [get_ports {weightValue[7]}]
set_max_capacitance 0.01  [get_ports {weightValue[6]}]
set_max_capacitance 0.01  [get_ports {weightValue[5]}]
set_max_capacitance 0.01  [get_ports {weightValue[4]}]
set_max_capacitance 0.01  [get_ports {weightValue[3]}]
set_max_capacitance 0.01  [get_ports {weightValue[2]}]
set_max_capacitance 0.01  [get_ports {weightValue[1]}]
set_max_capacitance 0.01  [get_ports {weightValue[0]}]
set_max_capacitance 0.01  [get_ports {biasValue[31]}]
set_max_capacitance 0.01  [get_ports {biasValue[30]}]
set_max_capacitance 0.01  [get_ports {biasValue[29]}]
set_max_capacitance 0.01  [get_ports {biasValue[28]}]
set_max_capacitance 0.01  [get_ports {biasValue[27]}]
set_max_capacitance 0.01  [get_ports {biasValue[26]}]
set_max_capacitance 0.01  [get_ports {biasValue[25]}]
set_max_capacitance 0.01  [get_ports {biasValue[24]}]
set_max_capacitance 0.01  [get_ports {biasValue[23]}]
set_max_capacitance 0.01  [get_ports {biasValue[22]}]
set_max_capacitance 0.01  [get_ports {biasValue[21]}]
set_max_capacitance 0.01  [get_ports {biasValue[20]}]
set_max_capacitance 0.01  [get_ports {biasValue[19]}]
set_max_capacitance 0.01  [get_ports {biasValue[18]}]
set_max_capacitance 0.01  [get_ports {biasValue[17]}]
set_max_capacitance 0.01  [get_ports {biasValue[16]}]
set_max_capacitance 0.01  [get_ports {biasValue[15]}]
set_max_capacitance 0.01  [get_ports {biasValue[14]}]
set_max_capacitance 0.01  [get_ports {biasValue[13]}]
set_max_capacitance 0.01  [get_ports {biasValue[12]}]
set_max_capacitance 0.01  [get_ports {biasValue[11]}]
set_max_capacitance 0.01  [get_ports {biasValue[10]}]
set_max_capacitance 0.01  [get_ports {biasValue[9]}]
set_max_capacitance 0.01  [get_ports {biasValue[8]}]
set_max_capacitance 0.01  [get_ports {biasValue[7]}]
set_max_capacitance 0.01  [get_ports {biasValue[6]}]
set_max_capacitance 0.01  [get_ports {biasValue[5]}]
set_max_capacitance 0.01  [get_ports {biasValue[4]}]
set_max_capacitance 0.01  [get_ports {biasValue[3]}]
set_max_capacitance 0.01  [get_ports {biasValue[2]}]
set_max_capacitance 0.01  [get_ports {biasValue[1]}]
set_max_capacitance 0.01  [get_ports {biasValue[0]}]
set_max_capacitance 0.01  [get_ports {config_layer_num[31]}]
set_max_capacitance 0.01  [get_ports {config_layer_num[30]}]
set_max_capacitance 0.01  [get_ports {config_layer_num[29]}]
set_max_capacitance 0.01  [get_ports {config_layer_num[28]}]
set_max_capacitance 0.01  [get_ports {config_layer_num[27]}]
set_max_capacitance 0.01  [get_ports {config_layer_num[26]}]
set_max_capacitance 0.01  [get_ports {config_layer_num[25]}]
set_max_capacitance 0.01  [get_ports {config_layer_num[24]}]
set_max_capacitance 0.01  [get_ports {config_layer_num[23]}]
set_max_capacitance 0.01  [get_ports {config_layer_num[22]}]
set_max_capacitance 0.01  [get_ports {config_layer_num[21]}]
set_max_capacitance 0.01  [get_ports {config_layer_num[20]}]
set_max_capacitance 0.01  [get_ports {config_layer_num[19]}]
set_max_capacitance 0.01  [get_ports {config_layer_num[18]}]
set_max_capacitance 0.01  [get_ports {config_layer_num[17]}]
set_max_capacitance 0.01  [get_ports {config_layer_num[16]}]
set_max_capacitance 0.01  [get_ports {config_layer_num[15]}]
set_max_capacitance 0.01  [get_ports {config_layer_num[14]}]
set_max_capacitance 0.01  [get_ports {config_layer_num[13]}]
set_max_capacitance 0.01  [get_ports {config_layer_num[12]}]
set_max_capacitance 0.01  [get_ports {config_layer_num[11]}]
set_max_capacitance 0.01  [get_ports {config_layer_num[10]}]
set_max_capacitance 0.01  [get_ports {config_layer_num[9]}]
set_max_capacitance 0.01  [get_ports {config_layer_num[8]}]
set_max_capacitance 0.01  [get_ports {config_layer_num[7]}]
set_max_capacitance 0.01  [get_ports {config_layer_num[6]}]
set_max_capacitance 0.01  [get_ports {config_layer_num[5]}]
set_max_capacitance 0.01  [get_ports {config_layer_num[4]}]
set_max_capacitance 0.01  [get_ports {config_layer_num[3]}]
set_max_capacitance 0.01  [get_ports {config_layer_num[2]}]
set_max_capacitance 0.01  [get_ports {config_layer_num[1]}]
set_max_capacitance 0.01  [get_ports {config_layer_num[0]}]
set_max_capacitance 0.01  [get_ports {config_neuron_num[31]}]
set_max_capacitance 0.01  [get_ports {config_neuron_num[30]}]
set_max_capacitance 0.01  [get_ports {config_neuron_num[29]}]
set_max_capacitance 0.01  [get_ports {config_neuron_num[28]}]
set_max_capacitance 0.01  [get_ports {config_neuron_num[27]}]
set_max_capacitance 0.01  [get_ports {config_neuron_num[26]}]
set_max_capacitance 0.01  [get_ports {config_neuron_num[25]}]
set_max_capacitance 0.01  [get_ports {config_neuron_num[24]}]
set_max_capacitance 0.01  [get_ports {config_neuron_num[23]}]
set_max_capacitance 0.01  [get_ports {config_neuron_num[22]}]
set_max_capacitance 0.01  [get_ports {config_neuron_num[21]}]
set_max_capacitance 0.01  [get_ports {config_neuron_num[20]}]
set_max_capacitance 0.01  [get_ports {config_neuron_num[19]}]
set_max_capacitance 0.01  [get_ports {config_neuron_num[18]}]
set_max_capacitance 0.01  [get_ports {config_neuron_num[17]}]
set_max_capacitance 0.01  [get_ports {config_neuron_num[16]}]
set_max_capacitance 0.01  [get_ports {config_neuron_num[15]}]
set_max_capacitance 0.01  [get_ports {config_neuron_num[14]}]
set_max_capacitance 0.01  [get_ports {config_neuron_num[13]}]
set_max_capacitance 0.01  [get_ports {config_neuron_num[12]}]
set_max_capacitance 0.01  [get_ports {config_neuron_num[11]}]
set_max_capacitance 0.01  [get_ports {config_neuron_num[10]}]
set_max_capacitance 0.01  [get_ports {config_neuron_num[9]}]
set_max_capacitance 0.01  [get_ports {config_neuron_num[8]}]
set_max_capacitance 0.01  [get_ports {config_neuron_num[7]}]
set_max_capacitance 0.01  [get_ports {config_neuron_num[6]}]
set_max_capacitance 0.01  [get_ports {config_neuron_num[5]}]
set_max_capacitance 0.01  [get_ports {config_neuron_num[4]}]
set_max_capacitance 0.01  [get_ports {config_neuron_num[3]}]
set_max_capacitance 0.01  [get_ports {config_neuron_num[2]}]
set_max_capacitance 0.01  [get_ports {config_neuron_num[1]}]
set_max_capacitance 0.01  [get_ports {config_neuron_num[0]}]
set_load -pin_load -max  0.05  [get_ports {VDD}]
set_load -pin_load -min  0.05  [get_ports {VDD}]
set_load -pin_load -max  0.05  [get_ports {VSS}]
set_load -pin_load -min  0.05  [get_ports {VSS}]
set_max_fanout 20  [get_designs {DNN}]
set_max_transition 0.07  [get_designs {DNN}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[17]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[17]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[24]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[24]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[31]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[31]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[12]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[12]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[28]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[28]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[8]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[8]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[4]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[4]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[1]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[1]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[14]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[14]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[21]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[21]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[6]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[6]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[18]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[18]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[25]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[25]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[15]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[15]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[3]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[3]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[18]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[18]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[25]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[25]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[20]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[20]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[13]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[13]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[0]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[0]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[29]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[29]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[10]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[10]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[9]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[9]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[5]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[5]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[2]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[2]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[15]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[15]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[22]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[22]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[19]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[19]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[26]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[26]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[7]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[7]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[4]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[4]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[10]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[10]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[19]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[19]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[26]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[26]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[21]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[21]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[14]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[14]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {weightValid}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {weightValid}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[1]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[1]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[11]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[11]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[6]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[6]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[3]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[3]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[16]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[16]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[23]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[23]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[30]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[30]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[27]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[27]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[8]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[8]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[5]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[5]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data_valid}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data_valid}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[11]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[11]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[27]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[27]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[22]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[22]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[15]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[15]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[2]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[2]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[12]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[12]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[0]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[0]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[7]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[7]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[4]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[4]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[17]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[17]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[24]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[24]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[31]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[31]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[28]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[28]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[9]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[9]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[6]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[6]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[12]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[12]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[28]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[28]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[30]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[30]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[23]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[23]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[16]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[16]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[3]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[3]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[1]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[1]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[13]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[13]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[20]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[20]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[10]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[10]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[8]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[8]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[5]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[5]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[18]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[18]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[25]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[25]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[29]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[29]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[7]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[7]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[13]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[13]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[20]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[20]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {biasValid}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {biasValid}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[29]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[29]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[31]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[31]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[24]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[24]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[17]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[17]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[4]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[4]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[0]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[0]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[10]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[10]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[14]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[14]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[21]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[21]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[2]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[2]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[9]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[9]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[11]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[11]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[6]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[6]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[19]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[19]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[26]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[26]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[8]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[8]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[14]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[14]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[21]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[21]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[25]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[25]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[18]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[18]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[1]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[1]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[5]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[5]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[11]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[11]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[15]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[15]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[22]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[22]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[3]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[3]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[12]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[12]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[7]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[7]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[0]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[0]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[27]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[27]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[9]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[9]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[15]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[15]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[22]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[22]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[10]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[10]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[26]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[26]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[19]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[19]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[6]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[6]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[2]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[2]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[12]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[12]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[16]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[16]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[23]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[23]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[30]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[30]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[4]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[4]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[13]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[13]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[8]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[8]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[1]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[1]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[28]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[28]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[16]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[16]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[23]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[23]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[30]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[30]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[11]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[11]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[27]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[27]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[7]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {biasValue[7]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[3]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[3]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[0]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[0]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[13]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[13]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[20]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[20]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[17]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[17]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[24]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[24]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[31]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {weightValue[31]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[5]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[5]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[14]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data[14]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[9]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_neuron_num[9]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[2]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[2]}]
set_input_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[29]}]
set_input_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {config_layer_num[29]}]
set_output_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {class_id[0]}]
set_output_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {class_id[0]}]
set_output_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data_ready}]
set_output_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {axis_in_data_ready}]
set_output_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {class_id[3]}]
set_output_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {class_id[3]}]
set_output_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {class_id[1]}]
set_output_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {class_id[1]}]
set_output_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {class_valid}]
set_output_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {class_valid}]
set_output_delay -add_delay 1 -min -clock [get_clocks {s_axi_aclk}] [get_ports {class_id[2]}]
set_output_delay -add_delay 3 -max -clock [get_clocks {s_axi_aclk}] [get_ports {class_id[2]}]
set_clock_uncertainty 0.2 -hold [get_clocks {s_axi_aclk}]
set_clock_uncertainty 0.5 -setup [get_clocks {s_axi_aclk}]
set_false_path  -from [get_ports {s_axi_aresetn}] 
